{
  "projects" : [
    {
      "title": "Vimgur",
      "descrpition": "React",
      "text": "Vimgur is a site inspired by imgur and vimeo. It's a hybrid that is meant to showcase the most interesting videos people come across on vimeo. Vimgur is built with Ruby on Rails on the backend, a PostgreSQL database, and a ReactJS with Redux architecture for the frontend.",
      "image": "vimgur.png",
      "path": "vimgur",
      "thumb": "vimgur.png",
      "link": "https://vimgur.herokuapp.com",
      "github": "https://github.com/mloreti/vimgur"
    },
    {
      "title": "TrippyCalc",
      "descrpition": "Vue",
      "text": "TrippyCalc is a solution for estimating the costs of a road trip. Users simply input their starting location and destination, the route is calculated and displayed on the map. Road trippers then have the option to adjust the details using the sliders in the adjustments section to estimate the cost and time.",
      "image": "trippycalc.png",
      "path": "trippycalc",
      "thumb": "trippycalc.png",
      "link": "https://mloreti.github.io/trippycalc",
      "github": "https://github.com/mloreti/trippycalc"
    },
    {
      "title": "Itinerary App",
      "descrpition": "Angular",
      "text": "An app built with Angular to help organize your travel bookings. This project came from a problem I had while traveling on my honeymoon. 5 hotels, 4 flights, and a car rental. Integrates the GoogleMaps Embed API.",
      "image": "itinerary.png",
      "path": "itinerary",
      "thumb": "itinerary.png",
      "link": "/itinerary"
    },
    {
      "title": "Boot Quiz",
      "descrpition": "Javascript",
      "text": "A quiz to help people find the best football/soccer boots for their needs. Built with jQuery and vanilla JS.",
      "image": "bootquiz.png",
      "path": "bootquiz",
      "thumb": "bootquiz.png",
      "link": "/bootquiz"
    },
    {
      "title": "Goals",
      "descrpition": "D3",
      "text": "I've always been interested in learning about D3 and it's data visualization capabalities. So in an effort to learn the basics of D3, I gathered data from WhoScored.com and Wikipedia of some of the world's best goal scorers and greated a bar graph of their goals scored over the last 4 seasons. I gathered the data into a spreadsheet then converted that CSV data into JSON formatted data. Finally, using D3 and javascript, I parsed the data into visual representation of each player.",
      "image": "goals.png",
      "path": "goals",
      "thumb": "goals.png",
      "link": "/goals"
    }
  ]
}
